Revit 2027 API
FailureDefinition.Severity Property
 The severity of the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureSeverity Severity { get; }
Public ReadOnly Property Severity As FailureSeverity
	Get
public:
property FailureSeverity Severity {
	FailureSeverity get ();
}
member Severity : FailureSeverity with get
Property Value
FailureSeverity
See Also
Reference
FailureDefinition Class
Autodesk.Revit.DB Namespace